{"format": "graph-model", "generatedBy": "2.3.1", "convertedBy": "TensorFlow.js Converter v2.7.0", "userDefinedMetadata": {"signature": {"inputs": {"X:0": {"name": "X:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "784"}]}}}, "outputs": {"accuracy_calc/prediction:0": {"name": "accuracy_calc/prediction:0", "dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "-1"}]}}}}}, "modelTopology": {"node": [{"name": "X", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "784"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Layer1/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Layer1/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Layer2/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Layer2/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Output/w", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "Output/b", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction/dimension", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Layer1/MatMul", "op": "MatMul", "input": ["X", "Layer1/w"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Layer1/add", "op": "AddV2", "input": ["Layer1/MatMul", "Layer1/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Layer1/Relu", "op": "Relu", "input": ["Layer1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Layer2/MatMul", "op": "MatMul", "input": ["Layer1/Relu", "Layer2/w"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Layer2/add", "op": "AddV2", "input": ["Layer2/MatMul", "Layer2/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Layer2/Relu", "op": "Relu", "input": ["Layer2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Output/MatMul", "op": "MatMul", "input": ["Layer2/Relu", "Output/w"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "Output/add", "op": "AddV2", "input": ["Output/MatMul", "Output/b"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Output/Softmax", "op": "Softmax", "input": ["Output/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "accuracy_calc/prediction", "op": "ArgMax", "input": ["Output/Softmax", "accuracy_calc/prediction/dimension"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "output_type": {"type": "DT_INT64"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "Layer1/w", "shape": [784, 512], "dtype": "float32"}, {"name": "Layer1/b", "shape": [512], "dtype": "float32"}, {"name": "Layer2/w", "shape": [512, 64], "dtype": "float32"}, {"name": "Layer2/b", "shape": [64], "dtype": "float32"}, {"name": "Output/w", "shape": [64, 10], "dtype": "float32"}, {"name": "Output/b", "shape": [10], "dtype": "float32"}, {"name": "accuracy_calc/prediction/dimension", "shape": [], "dtype": "int32"}]}]}